# Ejercicios de clase Modulo 3

# Numpy avanzado

In [2]:
import numpy as np
import pandas as pd
import seaborn as sns

In [ ]:
lista = []
for i in range(2, 40, 2):
        lista.append(i)
        
np.array(lista).shape

In [4]:
array_pares = np.array([i for i in range(2, 22, 2)])

In [ ]:
array_pares.ndim # una dimension

In [ ]:
array_pares.size # tamaÃ±o, numero de elementos totales

In [ ]:
array_pares.shape # nro de elementos en cada dimension

In [ ]:
array_pares.dtype # tipo de datos

In [ ]:
# crea una lista de 5 pares y otra de 5 impares y utilizar un metodo de np para pasarlo a una matriz de 2x5
# concatenate y reshape
array_pares = np.array([i for i in range(2, 12, 2)])
array_impares = np.array([i for i in range(1, 11, 2)])
todos = np.concatenate((array_pares, array_impares))
nuevo5x2 = todos.reshape(5, 2)
nuevo5x2

In [ ]:
"""! pip install plotly
! pip install pillow
! pip install folium
! pip install openpyxl
! pip install requests
"""

In [ ]:
lista = ([2, 4, 6, 8], [10, 12, 14, 16], [18, 20, 22, 24], [26, 28, 30, 32], [34, 36, 38, 40])
np.array(lista)

In [ ]:
np.argmin(lista)

In [ ]:
np.argmax(lista)

In [ ]:
np.reshape(lista, newshape = (4, 5))

In [ ]:
nuevo5x2.dtype

In [ ]:
np.hstack((nuevo5x2, nuevo5x2)) #en horizontal

In [ ]:
# aplana de dos dimensiones a una dimension
nuevo5x2.flatten()

In [ ]:
np.vstack((nuevo5x2, nuevo5x2)) # en vertical

np.column_stack((array_pares, array_impares))

In [ ]:
nuevo5x2.T

In [ ]:
print(array_pares)
indices = np.where(array_pares > 5) #devuelve los indices de los elementos que cumplen con las condiciones
array_pares[indices]

# Introduccion Pandas

In [21]:
# import pandas as pd

In [ ]:
print(f"pandas=={pd.__version__}")

* Cargar un dataframe desde una lista

In [23]:
#Crear Data Frame de 0
df = pd.DataFrame()

In [ ]:
lista = list(range(100, 105))
df["nueva columna1"] = lista
df["nueva_columna2"] = lista
# df["total_price"] = df[unit_price"] * df[quantity]]
df

* Cargar una matriz en un dataframe

In [25]:
matriz =[[1, 2, 3],
         [4, 5, 6],
         [7, 8, 9]]

In [ ]:
pd.DataFrame(matriz, columns = ["col_1", "col_2", "col_3"])

In [ ]:
#diccionario = {num : 1 for num, 1}

* Cargar un CSV con pandas

In [28]:
iris = pd.read_csv(filepath_or_buffer="iris.csv")

* Cargar un xls en pandas

In [ ]:
pd.read_excel(io="iris.xlsx") #se necesita tener installado el openpyxl (pip install openpyxl)

In [ ]:
iris.head() #muestra las 5 primeras filas

In [ ]:
iris.tail() # muestra las 5 ultimas filas

In [ ]:
iris.tail(10) # muestra las 10 ultimas

In [ ]:
iris.info()

In [ ]:
iris.columns

In [ ]:
type(iris["Largo Sepalo"].values)

In [ ]:
iris["Largo Petalo"]

In [ ]:
iris[["Ancho Petalo", "Ancho Sepalo"]]
df_iris = iris[["Ancho Petalo", "Ancho Sepalo"]].copy() #crea una copia con la que se puede jugar sin afectar al original

In [ ]:
iris["Clase"]

In [ ]:
iris["Largo Sepalo"][2] # iris[columna][indice fila]
iris["Largo Sepalo"].iat[2] # este es lo mismo que el anterior

In [ ]:
iris.iloc[0]

In [ ]:
iris.iloc[0, 1]

In [ ]:
iris[["Largo Sepalo", "Ancho Sepalo"]].cumsum()

In [ ]:
iris.iloc[:, -1] # pilla la ultima columna

In [ ]:
iris.iloc[:, -1].mode() # saca la moda, en este caso dice que son las tres pues de todas hay 50 ocurrencias

In [ ]:
iris.count()

In [ ]:
iris.describe() #hace todos los calculos de cada columna

In [ ]:
iris.describe(include='all') # incluye tambien las de tipo texto

In [ ]:
# en caso de tener muchas columnas, se puede invertir la matriz de estadisticas
iris.describe(include='all').T

In [ ]:
iris.sort_values("Largo Sepalo")

In [ ]:
iris.sort_values(["Largo Sepalo", "Largo Petalo"]) # no olvidar los corchetes cuando hay mas de un valor

In [ ]:
top_10_iris_largo_sepalo = iris.sort_values("Largo Sepalo", ascending=False)[:10]
top_10_iris_largo_sepalo

In [ ]:
# Ordenar por sepalo descendente y dentro por petalo ascendente y muestra los 20 primeros
iris.sort_values(["Largo Sepalo", "Largo Petalo"], ascending=[False, True]).head(20)

In [ ]:
iris["Clase"].nunique() #numero de datos unicos en una columna

In [ ]:
iris["Clase"].value_counts() #numero de valores unicos en una columna, se utiliza para saber si hay desbalanceo de clases

In [ ]:
iris["Clase"].value_counts(normalize= True) #muestra el porcentaje  que representa cada valor

In [ ]:
iris.drop[2] #borra la fila 2
iris.drop[2, axis = 1] # borra columna 2 , las columnas empiezan en 0

# 26-12-2024
* Pandas avanzados ejercicios pandas_2

In [3]:
df1 = pd.read_csv("titanic_1.csv")
df2 = pd.read_csv("titanic_2.csv")
df3 = pd.read_csv("titanic.csv")

In [ ]:
df1.head()

In [ ]:
df2.head()

In [ ]:
df1["Age"] > 18 #serie

In [ ]:
df1.info() #hay presencia de nulos en Age

In [6]:
df3.head()

,PassengerId,Name,Sex,Age,Survived,Pclass,Ticket,Fare
0,1,"Braund, Mr. Owen Harris",male,22.0,0,3,A/5 21171,7.2500
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,1,PC 17599,71.2833
2,3,"Heikkinen, Miss. Laina",female,26.0,1,3,STON/O2. 3101282,7.9250
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,1,113803,53.1000
4,5,"Allen, Mr. William Henry",male,35.0,0,3,373450,8.0500

In [ ]:
#Ejercicio 1
df3.info()

In [ ]:
#Ejercicio 2
#Transformar solo una columna
df3["Sex"] = df3["Sex"].astype("category")
df3["Sex"]

In [ ]:
#transformar varias columnas a la vez
df3[["Sex", "Name", "Ticket"]] = df3[["Sex", "Name", "Ticket"]].astype("category")
df3.info()

In [ ]:
#Ejercicio 3
#filtro
df3["Sex"] == "male"

In [ ]:
# obtener datos filtrados
df3_male = df3[df3["Sex"] == "male"]
df3_male

In [ ]:
#Ejercicio 4
df3[(df3["Pclass"] == 1) | (df3["Pclass"] ==2)]

In [ ]:
df3_clas = df2[df3["Pclass"].isin([1, 2])]
df3_clas

In [ ]:
#Ejercicio 5
#df3_clas = df3(df3["Pclass"].isin([1, 3])) & (df3["Age"] < 30)

In [ ]:
df3[ (df3["Pclass"].isin([1, 3])) & (df3["Age"] < 30) ]

In [ ]:
clase_1_3 = df3["Pclass"].isin([1, 3])
menor_30 = df3["Age"] < 30
df3[clase_1_3 & menor_30]

In [ ]:
#Ejercicio 6
df3[(df3["Age"].between(20, 30))]

In [ ]:
df3[(df3["Age"].between(20, 30))].describe() #igual al anterior pero agrega estadisticas

In [ ]:
#Ejericio 7
df3[~df3["Age"].between(25, 50)]

In [113]:
#Ejercicio 8
#Transformar datos

In [ ]:
#crear un diccionario con clave male con valor M y clave female con valor F
genre_dict = {"male": "M", "female": "F"}
# pasar el dicionario como parametro de la funcion .map sobre la columna genero
df3["Sex"].map(genre_dict)

In [ ]:
df3["Sex"].unique() #se conservan los originales porque no se ha guardado

In [116]:
#Ejercicio 9
#funcion apply: recibe una funcion def o una funcion lambda
#usamos def cuando el codigo involucra varias sentencias

In [ ]:
def convertir_a_mayusculas(text):
    return text.upper()
df3["Name"].apply(convertir_a_mayusculas)

In [ ]:
#usar una lambda cunado la transformacion requiere poco codigo
# df3["Name"].apply(lambda name: name.upper()) con variables mas significativas
df3["Name"].apply(lambda x: x.upper())

In [ ]:
#apply se puede usar tanto en Series como en Dataframes, donde se puede aplicar con axis= 1 o axis=0 
# para utilizarlo en filas o en columnas
#apply es ideal para casos mas avanzados
df3["Name"].map(lambda x: x.upper()) # se puede utilizar el map tambien pasandole una lambda

In [ ]:
#Paga si sobrevivio!!!
df3.apply(lambda row: row["Fare"] * row["Survived"], axis=1)

### Manipulacion de NaN's
    * Encontrar Nans
    * Eliminar o rellenarlos

In [ ]:
#Encontrar NaN
df3["Age"].value_counts()

In [ ]:
df3["Age"].value_counts(dropna=False)

In [ ]:
#el metodo .isna es igual que .isnull
df3[df3["Age"].isnull()]

In [ ]:
nulos = df3["Age"].isnull()
df[~nulos] #filtrar por aquellos que si tengan edad

In [ ]:
df3.isna().sum() #sumar los NaN de cada columna y mostra la suma de cada una

In [ ]:
df3.isna().sum()*100/df3.shape[0] #saca el porcentaje que implican los null en el DataFrame

### Estrategias para el tratamiento de valores nulos
    * Filtrar aquellos que no sean null 
        df3[~df3["Age"].isnull()]

    * Eliminar filas con nulos: 
        df3.dropna() se carga todas las filas nulas, es muy agresivo

    * Eliminar columnas con nulos:
        * Para casos que haya muchos nulos > 80%
        * df3.drop("clase", axis = 1)

    * Rellenar los valores nullos:
        * Si es numerico habitualmente se rellena con la media o mediana.
        * df3["Age"].fillna(20) 
        * Si es texto o categÃ³rico: se rellena con la moda o con un valor fijo (Ej. Otros)
        * Si es fecha: se puede rellenar con el valor justo anterior o el posterior
        * Para imputacion mas sofisticada:
            * aplicar una funcion con logica para decidir como rellenar ese valor en base a otras columnas
            * utilizar imputers de scikit learn que hagan predicciones
            * Utilizar aprendizaje no supervisado para etiquetar clusters

In [ ]:
#Rellenar los NaN's con mediana
median = df3["Age"].median
print(median)
df3["Age"] =df3["Age"].fillna(df3["Age"].median)

In [ ]:
#Verificar el rellenado
df3.isnull().sum()

### Agrupaciones

In [145]:
df4 = pd.read_excel("Canada.xlsx")

In [ ]:
df4.head(3)

In [ ]:
df4.groupby(by="Continente") # agrupa por continente

In [ ]:
df4.groupby(by="Continente").sum() #calcula la suma por continente

In [ ]:
df3.groupby(by = "Sex").count()

In [ ]:
# si es category no pertmite ciertas operaciones de agregaciÃ³n numericas
df3.groupby(by= "Sex")["Fare"].sum()

In [ ]:
df3[df3["Sex"] == "female"]["Fare"].sum()

In [157]:
df3.groupby(by="Sex")["Fare"].agg("mean")

C:\Users\user\AppData\Local\Temp\ipykernel_17064\3976181949.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df3.groupby(by="Sex")["Fare"].agg("mean")

Sex
female    44.479818
male      25.523893
Name: Fare, dtype: float64

In [158]:
# el .agg o aggregate permite hacer mas de un calculo sobre el grupo
df3.groupby(by="Sex")["Fare"].agg(["mean", "median", "std", "min", "max"])

C:\Users\user\AppData\Local\Temp\ipykernel_17064\4089381763.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df3.groupby(by="Sex")["Fare"].agg(["mean", "median", "std", "min", "max"])

             mean  median        std   min       max
Sex
female  44.479818    23.0  57.997698  6.75  512.3292
male    25.523893    10.5  43.138263  0.00  512.3292

In [5]:
df3.groupby(by="Sex").agg({
    "Fare": ["mean", "median"], 
    "Age": ["min", "max", "median", "mean"]})

             Fare          Age
             mean median   min   max median       mean
Sex
female  44.479818   23.0  0.75  63.0   27.0  27.915709
male    25.523893   10.5  0.42  80.0   29.0  30.726645

In [8]:
df3.groupby(by=["Sex", "Survived"]).agg({
    "Fare": ["mean", "median"], 
    "Age": ["min", "max", "median", "mean"]})

                      Fare             Age
                      mean    median   min   max median       mean
Sex    Survived
female 0         23.024385  15.24580  2.00  57.0   24.5  25.046875
       1         51.938573  26.00000  0.75  63.0   28.0  28.847716
male   0         21.960993   9.41665  1.00  74.0   29.0  31.618056
       1         40.821484  26.28750  0.42  80.0   28.0  27.276022

In [10]:
#as_index= False crea columnas en vez de indices 
df31 = df3.groupby(by=["Sex", "Survived"], as_index= False).agg({
    "Fare": ["mean", "median"], 
    "Age": ["min", "max", "median", "mean"]})
df31

      Sex Survived       Fare             Age
                         mean    median   min   max median       mean
0  female        0  23.024385  15.24580  2.00  57.0   24.5  25.046875
1  female        1  51.938573  26.00000  0.75  63.0   28.0  28.847716
2    male        0  21.960993   9.41665  1.00  74.0   29.0  31.618056
3    male        1  40.821484  26.28750  0.42  80.0   28.0  27.276022

In [12]:
#drop_duplicate borra las filas si son identicas, es decir, duplicadas
print(f"shape original: {df3.shape}")
print(f"shape sin duplicates: {df3.drop_duplicates().shape}")

shape original: (891, 8)
shape sin duplicates: (891, 8)

### Merge (join)

In [18]:
#por defecto en inner: debe existir el PassengerId en los dos CSV sino ignora la fila, si se le pone
# how="left" Ã³ how= "right" sÃ­ lo trae pero deja el resto de los datos de la fila en NaN
df5 = pd.merge(left = df1, right= df2, left_on= "PassengerId", right_on="PassengerId", how="inner")
df1.head(1)
# df5 = pd.merge(df1, df2)

   PassengerId                     Name   Sex   Age
0            1  Braund, Mr. Owen Harris  male  22.0

In [16]:
df2.head(1)

   PassengerId  Survived  Pclass     Ticket  Fare
0            1         0       3  A/5 21171  7.25

In [17]:
df5.head(1)

,PassengerId,Name,Sex,Age,Survived,Pclass,Ticket,Fare
0,1,"Braund, Mr. Owen Harris",male,22.0,0,3,A/5 21171,7.25

In [19]:
#estadisticas (.T para trasponer y ver mejor la tabla, sino es muy larga)
df1.describe(include="all").T

,count,unique,top,freq,mean,std,min,25%,50%,75%,max
PassengerId,891.0,NaN,NaN,NaN,446.0,257.353842,1.0,223.5,446.0,668.5,891.0
Name,891,891,"Dooley, Mr. Patrick",1,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Sex,891,2,male,577,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Age,714.0,NaN,NaN,NaN,29.699118,14.526497,0.42,20.125,28.0,38.0,80.0

03 pandas avanzado

In [20]:
#ejercicio 1
df2.describe(include="all").T

,count,unique,top,freq,mean,std,min,25%,50%,75%,max
PassengerId,891.0,NaN,NaN,NaN,446.0,257.353842,1.0,223.5,446.0,668.5,891.0
Survived,891.0,NaN,NaN,NaN,0.383838,0.486592,0.0,0.0,0.0,1.0,1.0
Pclass,891.0,NaN,NaN,NaN,2.308642,0.836071,1.0,2.0,3.0,3.0,3.0
Ticket,891,681,347082,7,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Fare,891.0,NaN,NaN,NaN,32.204208,49.693429,0.0,7.9104,14.4542,31.0,512.3292

In [ ]:
#ejercicio 2
pd.merge(df1, df2)

In [21]:
#Ejercicio 3
df1[["Name", "Age"]].tail(5)

                                         Name   Age
886                     Montvila, Rev. Juozas  27.0
887              Graham, Miss. Margaret Edith  19.0
888  Johnston, Miss. Catherine Helen "Carrie"   NaN
889                     Behr, Mr. Karl Howell  26.0
890                       Dooley, Mr. Patrick  32.0

In [22]:
#Ejercicio 4
df1[df1["Sex"]== "female"].head()

,PassengerId,Name,Sex,Age
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0
2,3,"Heikkinen, Miss. Laina",female,26.0
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0
8,9,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0
9,10,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0

In [28]:
df_1 = df1[(df1["Fare"] < 33) & (df1["Pclass"] == 2)] # no funciona ver origen profe

KeyError: 'Fare'

In [ ]:
# Ejercicio 7 ver profe
df1["Sex"] == "male"

In [27]:
# Ejercicio 20 
# #Discretizar una variable
def rango_edad(edad):
    if edad < 11:
        return "NiÃ±o"
    elif edad < 18:
        return "Joven"
    elif edad < 50:
        return "Adulto"
    else:
        return "Mayor"


df1["age_range"] = df1["Age"].apply(rango_edad)
df1.head()

,PassengerId,Name,Sex,Age,age_range
0,1,"Braund, Mr. Owen Harris",male,22.0,Adulto
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,Adulto
2,3,"Heikkinen, Miss. Laina",female,26.0,Adulto
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,Adulto
4,5,"Allen, Mr. William Henry",male,35.0,Adulto

In [ ]:
#Ejercicio 22 .Fillna()

In [36]:
#Ejercicio 24
# primero pasarlo a diccionario
df5.dtypes.to_dict()
# bucle for
for llave, valor in df5.dtypes.to_dict().items():
    print(llave)
    print(valor)
    if valor == "object":
        df5[llave] = df5[llave].apply(lambda x: x.upper())

df5.head()

PassengerId
int64
Name
object
Sex
object
Age
float64
Survived
int64
Pclass
int64
Ticket
object
Fare
float64

,PassengerId,Name,Sex,Age,Survived,Pclass,Ticket,Fare
0,1,"BRAUND, MR. OWEN HARRIS",MALE,22.0,0,3,A/5 21171,7.2500
1,2,"CUMINGS, MRS. JOHN BRADLEY (FLORENCE BRIGGS TH...",FEMALE,38.0,1,1,PC 17599,71.2833
2,3,"HEIKKINEN, MISS. LAINA",FEMALE,26.0,1,3,STON/O2. 3101282,7.9250
3,4,"FUTRELLE, MRS. JACQUES HEATH (LILY MAY PEEL)",FEMALE,35.0,1,1,113803,53.1000
4,5,"ALLEN, MR. WILLIAM HENRY",MALE,35.0,0,3,373450,8.0500